// Начальная цена за картину размером 40х50:  1000 (коэффициент равен 1),
//                                    50х70:  1200 (коэффициент равен 1.2), 
//                                    70х70:  1400 (коэффициент равен 1.4), 
//                                    70х100: 1600 (коэффициент равен 1.6);
// Материалы: волокно: + 1500, 
//            лён:     + 2000, 
//            хлопок:  + 2500;
// Доп.услуги: арт-гель: + 1000
//             экспресс: + 2000
//             доставка: + 1000
function calc() {
    let picturePrice = 1000,
        material = 1500,
        additionalServices = 1000;
//получить все элементы из селекотора размеров
//получить все элементы из селекотора материалов
//получить все элементы из селекотора доп. услуг
//получить промокод, если введён
//получить внутренность цветного поля для вывода туда результата


}

export default calc;